posts/blog/drafts/introducing-birdland.org
#+TITLE:  Lightning fast recommandation with Birdland
#+DATE: <2018-04-06 Sun>

* TODO Finish this damn blog post

This post is a long overdue post on a recommendation algorithm that I developed
and implemented with Etienne Duschene some 4 years ago: [[https://github.com/rlouf/birdland][Birdland]] (checkout the
code on Github). Although this might be considered "old" by modern standards, I
believe that in the days of overkill datascience there is something to be
learned from this algorithm and how it came to existence. I will explain the
meat of the algorithm and what you can do with it. And most importantly, how we
got there.

This is a long post, so get a good cup of coffee (tea) and sit comfortably.

* You have 2 weeks to come up with something

I was asked a little less than 2 years ago to design a music recommendation
algorithm for the application I was working on. The application was a social
network built around music; users had a profile where they curated artists and
song, and could share music with their friends. In app speech, think instagram
meets LastFM; the app did pretty well until the adventure abruptly ended, but
that's another story.

At the time, Spotify had [[https:][a full battery]] of recommendation algorithms in
production and it was obvious we could not compete. What we had that Spotify did
not, however, was a social graph. We had to do social recommendation. Well, in
fact we had promised social recommendation to a funding agency and got money to
do it, so we REALLY had to do it.

For the past 10 year or so, [[https:][implicitMF]] had been the go-to recommendation
method for implicit feedback contexts---and am sure still is. In ways it worked,
and it has amply contributed to what the world of recommendation is like today.
If, like me, you have as Spotify account you have probably been served some of
its results and anjoyed it (shoutout to [[https:][Erik Berhnarhdsson]], [[https:][Chris Johnson]]
and the talented people we don't hear about who created this fantastic
product!).

However, despite its past success, I quickly decided it was not going to cut it.
There are two things that I try to steer away from when I work on a machine
learning problem: complexity and conceptual smell. Unfortunately, ImplicitMF is
both dubious theoretically speaking, and harder to implement that it seems.

* ImplicitMF sucks

In the context of music recommendation, implicitMF sucks. I've said it.

** It smells conceptually


The MF part in "implicit MF" stands for implicit matrix factorization. Roughly
speaking, it starts with a matrix $R$ (user x song) where $R_{i,j}$ is the
number of times the user $i$ has played the song $j$. The $R_{i,j}$s constitue
\textit{implicit} feedback; historically recommendation started with rated
items. Here we don't have ratings, but data about interactions.

The method is essentially a dimensionality reduction method. For each user $i$
and song $j$ you want to find vectors $u_i$ and $v_j$ of dimension $K$ such that
the scalar product $u_i v_j$ is as close as $R_{i,j}$ as possible. I don't have
an issue with that. The problem is with how we define close: implicit MF
basically says the 2 are close when following $L_2$ norm is minimum:

$$L = \sum_{i,j} \left(R_{i,j} - u_i v_j\right)^2$$

Plus a regularization term. This can be solved approximately with [alternating
least square](). But let's take a step back here and think about the
signification of the $L_2$ norm. It may seem innocent to most, but it makes a
strong assumption about the distribution of plays.

> Implicit MF makes the implicit (!) assumption that the number of plays
> follows a normal distribution.

Indeed, if we write this:

$$
r_{i,j} \sim Normal(u_i v_j)
$$

Then finding the $\left\{u_i\right\}_{i=1..N}$ and $\left\{v_j\right\}_{j=1..S}$
that maximize the likelihood of the data amounts to... minimizing the $L_2$
norm!

It's bad. Think about it:

1. The normal distribution's support is the real line; it can give negative
   number. And unless you're feeling lucky or hacky, you may get negative
   counts;
2. If you look the $r_{i,j}$ over all users, getting the number of plays per
   user for each song you also get a Gaussian. Trust me on this, but the
   distribution of the number of plays does not look like a Gaussian at all:
   there is no "typical" number of plays that all values lie around. Actually,
   there are many users who do not listen to most songs.

The distribution looks more like a Poisson distirbution, actually. If this is
the only thing that bothers you, there is a great paper on [Poisson
factorization] that on top of using an underlying Poisson distirbution instead
of normal.

But as we will see, there is another problem with matrix factorization: the
hidden engineering costs.

