blog/drafts/introducing-birdland.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-09 Thu 16:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lightning fast recommandation with Birdland</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Lightning fast recommandation with Birdland</h1>

<div id="outline-container-org567a059" class="outline-2">
<h2 id="org567a059"><span class="todo TODO">TODO</span> Finish this damn blog post</h2>
<div class="outline-text-2" id="text-org567a059">
<p>
This post is a long overdue post on a recommendation algorithm that I developed
and implemented with Etienne Duschene and Nicolas Martyanoff some 4 years ago: <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/rlouf/birdland">Birdland</a> (checkout the
code on Github). Although this might be considered "old" by modern standards, I
believe that in the days of overkill datascience there is something to be
learned from this algorithm and how it came to existence. I will explain the
meat of the algorithm and what you can do with it. And most importantly, how we
got there.
</p>

<p>
This is a long post, so get a good cup of coffee (tea) and sit comfortably.
</p>
</div>
</div>

<div id="outline-container-orgb48c3ea" class="outline-2">
<h2 id="orgb48c3ea">You have to build a recommandation system</h2>
<div class="outline-text-2" id="text-orgb48c3ea">
<p>
I was asked a little less than 2 years ago to design a music recommendation
algorithm for the application I was working on. The application was a social
network built around music; users had a profile where they curated artists and
song, and could share music with their friends. In app speech, think instagram
meets LastFM; the app did pretty well until the adventure abruptly ended, but
that's another story.
</p>

<p>
At the time, Spotify had <a target='_blank' rel='noopener noreferrer' class='external' href="https:">a full battery</a> of recommendation algorithms in
production and it was obvious we could not compete. What we had that Spotify did
not, however, was a social graph. We had to do social recommendation. Well, in
fact we had promised social recommendation to a funding agency and got money to
do it, so we REALLY had to do it.
</p>

<p>
For the past 10 year or so, <a target='_blank' rel='noopener noreferrer' class='external' href="https:">implicitMF</a> had been the go-to recommendation
method for implicit feedback contexts&#x2014;and am sure still is. In ways it worked,
and it has amply contributed to what the world of recommendation is like today.
If, like me, you have as Spotify account you have probably been served some of
its results and anjoyed it (shoutout to <a target='_blank' rel='noopener noreferrer' class='external' href="https:">Erik Berhnarhdsson</a>, <a target='_blank' rel='noopener noreferrer' class='external' href="https:">Chris Johnson</a>
and the talented people we don't hear about who created this fantastic
product!).
</p>

<p>
However, despite its past success, we quickly decided it was not going to work for us.
There are two things that I try to steer away from when I work on a machine
learning problem: complexity and conceptual smell. Unfortunately, ImplicitMF is
both dubious theoretically speaking, and harder to implement that it seems.
</p>
</div>
</div>

<div id="outline-container-orgfeb12ba" class="outline-2">
<h2 id="orgfeb12ba">ImplicitMF sucks</h2>
<div class="outline-text-2" id="text-orgfeb12ba">
<p>
In the context of music recommendation, implicitMF sucks. I've said it.
</p>
</div>

<div id="outline-container-orga90736a" class="outline-3">
<h3 id="orga90736a">It smells conceptually</h3>
<div class="outline-text-3" id="text-orga90736a">
<p>
The MF part in "implicit MF" stands for implicit matrix factorization. Roughly
speaking, it starts with a matrix \(R\) (user x song) where \(R_{i,j}\) is the
number of times the user \(i\) has played the song \(j\). The $R<sub>i,j</sub>$s constitue
\textit{implicit} feedback; historically recommendation started with rated
items. Here we don't have ratings, but data about interactions.
</p>

<p>
The method is essentially a dimensionality reduction method. For each user \(i\)
and song \(j\) you want to find vectors \(u_i\) and \(v_j\) of dimension \(K\) such that
the scalar product \(u_i v_j\) is as close as \(R_{i,j}\) as possible. I don't have
an issue with that. The problem is with how we define close: implicit MF
basically says the 2 are close when following \(L_2\) norm is minimum:
</p>

<p>
\[L = \sum_{i,j} \left(R_{i,j} - u_i v_j\right)^2\]
</p>

<p>
Plus a regularization term. This can be solved approximately with [alternating
least square](). But let's take a step back here and think about the
signification of the \(L_2\) norm. It may seem innocent to most, but it makes a
strong assumption about the distribution of plays.
</p>

<p>
&gt; Implicit MF makes the implicit (!) assumption that the number of plays
&gt; follows a normal distribution.
</p>

<p>
Indeed, if we write this:
</p>

<p>
\[
r_{i,j} \sim Normal(u_i v_j)
\]
</p>

<p>
Then finding the \(\left\{u_i\right\}_{i=1..N}\) and \(\left\{v_j\right\}_{j=1..S}\)
that maximize the likelihood of the data amounts to&#x2026; minimizing the \(L_2\)
norm!
</p>

<p>
It's bad. Think about it:
</p>

<ol class="org-ol">
<li>The normal distribution's support is the real line; it can give negative
number. And unless you're feeling lucky or hacky, you may get negative
counts;</li>
<li>If you look the \(r_{i,j}\) over all users, getting the number of plays per
user for each song you also get a Gaussian. Trust me on this, but the
distribution of the number of plays does not look like a Gaussian at all:
there is no "typical" number of plays that all values lie around. Actually,
there are many users who do not listen to most songs.</li>
</ol>

<p>
The distribution looks more like a Poisson distirbution, actually. If this is
the only thing that bothers you, there is a great paper on [Poisson
factorization] that on top of using an underlying Poisson distirbution instead
of normal.
</p>

<p>
But as we will see, there is another problem with matrix factorization: the
hidden engineering costs.
</p>
</div>
</div>
