posts/blog/drafts/introducing-birdland.org
** It has hidden costs

The result of implicit Matrix Factorization is two matrices song-vector and
user-song; it is an embedding of songs and users in a K-dimensional space. But
this embedding is the first part of the process. What the tutorials you read on
the web usually don't tell you is that once your implicit MF implemented and
connected to the database you need to:

- Store these vectors in a database and recompute these vectors in batch.
- Given a user and its past plays, recommend new songs.

Without getting into details, you already see that what seemed to be a simple
recommendation service actually ends up being a 3 services ordeal: a server to
compute the vectors, a database to store these vectors, and a server to serve
recommendations based on user data. Not that simple, is it?

What is also omitted is that the recommendation part of the algorithm is
complicated, way complicated than the factorization part: the N-nearest neibour
problem.

The idea is to find the "song" vector that are the closest to your "user"
vector. For each user there are N such posibility. In real settings, this simply
does not scale. There are very clever approximation method that make the
computation scalable, but their details are much harder than implicitMF's.

See, had you started to work on implicitMF and went as far as factorizing the
plays matrix, you would have ended up in front of a much harder problem. I have
seen a lot of data scientists falling into the matrix factorization trap, and
taking their whole engineering team with them. Don't be that data scientist.

Birdland was born in a particular context. At the time I was working as Chief
Scientist (whatever that means) at a small Startup that built a social app
around music. To be completely honest, the goal of this project was more to show
off our capabilities (and spend funding we'd earned to develop it) rather than
answering a real need. Actually, the first version of "recommendation" was
simply to recomend to users songs they listened to in the past. This is a
great baseline for A/B testing, by the way.

And we had 3 weeks, and no engineering resources allocated. Needless to say, we
had to ditch matrix factorization early on.


* Here comes Birdland

So we sat down, and reformulated the problem as a question:

#+begin_quote
Given what a person has listened to in the past, who she interacts with, what is she going to do next?
#+end_quote

Well that sounds pretty damn obvious, doesn't it?

Now, this sounds a lot like a stochastic process. So we model the recommendation
process as a stochastic process over the global set of song: given the songs
that someone has listened to in the past, we have to find a process them to
songs that they haven't listened to but might like.

Building such a kernel is insanely complicated, it presupposes a model of the
user's behavior, understand how songs are related, and playing history. The best
thing we can do is to learn this kernel from the behavior of users themselves.


** A network perspective

Although this behaviour only holds in the infinite time limit, and
recommendations would initially be based on the local neighbourhood, this can be
considered as *bad* recommendation.

Can we do better?

Yes, by switching to a network representation!

Let us consider the network defined by $A_{ij}$ with nodes $\left\{1, \dots,S\right\}$ of degrees $\left\{k_1, \dots, k_S\right\}$, the number of times
they have each been listened to.

When no self loops are allowed (which is the case here), the random baseline for
such network is a network where edges are added at random under the constraints
that degrees need to stay the same. It can be shown that his model assigns to each edge the
probability:

$$
p_{ij}^{rand} = \frac{k_i k_j}{\sum_n k_n}
$$

On average, the number of edges in our random model is given by

$$
N_{ij}^{rand} = k_i k_j \frac{N}{\sum_n k_n}
$$

What is interesting for recommendations is the *deviation* from this random
model. Assuming the existence of a latent parameter $\theta_{ij}$ that
characterizes how "special" the connection between $i$ and $j$ is, we can write:

$$
p_{ij}^{rand} = \theta_{ij} \frac{k_i k_j}{\sum_n k_n}
$$

And we can compute the latent "attraction" factor

$$
\theta_{ij} \propto \frac{N_{ij}}{k_i k_j} \left(\frac{\sum_n k_n}{N}\right)
$$

If $\theta_{ij} < 1$, songs are less connected that they would have been had the
connections been drawn randomly; they probably should not be recommended one
after another. If $\theta_{ij}$ > 1 they are more connected than they would
have been if people were playing things randomly. The connection between these
two songs is probably meaningful, irrespective of the item's relative
popularity.


** Issues with this naive approach

Beyond the obvious criticisms that all recommendation schemes face, we had very
good reason to leave this method aside:

1. Projecting the user-songs bipartite graph onto the songs leads to an
   intractable transition matrix. In typical settings we have $10^7$ songs; ew
   would need to compute and keep track of a matrix of size $10^{14}$ values corresponding to every possible link.
2. The information contained in the user-song graph is partially washed out by
   the projection onto the items. Yet, it may contain interesting information

For these reasons, we turned to a simpler---yet surprisingly
powerful---approach: random walks on the bipartite graph. It doesn't get rid of
the user-song-user information, and only requires storing $N_{users}\;
\overline{\ell}$ elements where $\overline{\ell}$ is the average number of
distinct songs listened to by a user. The tradeoff: you have to recompute everything for each recommandation.


