posts/blog/drafts/introducing-birdland.org
** Recommendations using random walks.

For those of you who are old enough to have known LastFM, you probably used the
method I did when looking for new music to listen to. What I usually did was
finding the profile of people who had roughly similar tastes and explore they
history to find new things to listened to. Sometimes work, sometimes did not.
But still, it was pretty good.

For some of you who had friends, you probably ask for recommendations to people
you know have similar tastes to you, not to the others.

Both are local explorations of a bipartite graph. This is tedious work, but
imagine if you could do that a million times faster. Wouldn't you get
interesting results? Well, let's figure it out.


If I formalize and simplify the motivating examples I get the following
procedure:

1. Pick a song $i$ uniformly at random in my listen history;
2. Find a user $\mu$ who has listen to this song too;
3. Pick a song $j$ that this user has listened to uniformly at random and store
   to it.

The process is overly simplified: all songs that I listen to are equal in my
eyes. Some I like more and listen to heavily, some I like less. We'll see more
about that below.

We can write the probability $p_{ij}$ to pick the song $j$ starting from $i$ and
going through $\mu$ under this procedure:

$$
p_{ij}^{\mu} = \frac{1}{N_i} \frac{1}{k_{\mu}}
$$

where $N_i$ is the number of people who have listened to $i$ and $k_{\mu}$ the
number of songs the user $\mu$ has listened to. $p_{ij}^{\mu}$ is a transition
kernel. Indeed:

$$
\sum_{\mu, j} p_{ij}^{\mu} = \frac{1}{N_i} \sum_{\mu, j} \frac{1}{k_{\mu}} = 1
$$

The probability measure $\pi_i = N_i / N$ defined above is invariant under this
kernel:

$$
\sum_i \frac{N_i}{N} p_{ij}^{\mu} = \frac{1}{N} \sum_{i,\mu} \frac{1}{k_{\mu}} =
\frac{N_j}{N}
$$

Indeed, for each song $j$ the user $\mu$ has interacted with, all the other
items are included in the dum over $i$ so that the sum over $i$ and $\mu$ can be
reduced to a sum of $j$ times 1.

Don't be thrown off by these technical details and calculations: this algorithm
is simpler and easier to interpret than the naive one above, let alone implicit
matrix factorization.

** The long tail problem

[Explain the long-tail problem]

An issue that remains is that we leave the popularity distribution of songs
invariant under this transition kernel. The nice thing about this framework is
that it can be modified very easily. Let us imagine a procedure that could
diminish the "long-tail" problem:


1. Pick a song $i$ uniformly at random from your listening history;
2. Pick a user $\mu$ who has listened to this song uniformly at random;
3. Pick a song $j$ this user has listened to with probability inversely
   proportional to this item popularity.

The probability to walk from $i$ to $j$ via $\mu$ now reads:

$$
p_{ij}^\mu = \frac{\mathcal{N}_\mu}{N_i N_j}
$$

where

$$
\mathcal{N} = \frac{1}{\sum_{n=1}^{N_\mu} 1 / N_j}
$$

We now show that the uniform probability measure is left invariant under this
kernel:

$$
\sum_i \frac{1}{N} p_{ij}^{\mu} = \frac{1}{N N_j} \sum_{\mu, j}
\frac{\mathcak{N}_\mu}{N_i} = \frac{1/N}
$$

In layman speak, this means that, following this procedure, an infinitely long
random walk would go through each song the same number of times, disrepective of
its original popularity. **In other words, this algorithm addresses the
long-tail problem, or at least does not make it worse. This is intersting and,
to our knowledge, unique.**

Now, whether this is a good thing is another debate.

** Other variants

*** Social recommendation

You can customize this algorithm as you wish. In our case, the goal was to get
a recommendation algorithm that could be used for social recommendation. Easy:

1. Pick a song $i$ uniformly at random from your listening history;
2. Pick a user $\mu$ with a probability $\delta$ that depends on how close
   you are in the network.
3. Pick a song $j$ this user has listened to with probability inversely
   proportional to this item popularity.

In the limit $\delta = 1/N$ we recover the previous case. In the extreme limit
$\delta = 1/f$ where f is your number of friend, 0 otherwise we are in a
situation where you get most of your recommendations from your friends.

If you want to be fancy, you can say that you projected the multi-layer graph
user-user-song onto the user-song bipartite graph. Knowing that you can do even
fancier stuff by walking the social graph at the same time.

*** Not all songs are created equal

You don't listen to songs the same number of times, so it is pretty stupid to
pick songs uniformly at random in your history. Simple, just pick it at random
with a probability proportional to the number of times you have listened to this
song.

** Recommending items from a list of songs

To recommend songs to users you would perform many, many random walks starting
from that same user. Those walks will likely start from many different songs in
the listening history, and it is also likely that some songs will be traversed
by several walks. How do we combine these walks to provide recommendations.

There are several schemes you can think of:

*Most visited first:* We count the number of times each songs has been visited
and sort recommendations accordingly. This performs poorly in practice as you
end up recommending popular songs.

*Consensus:* Recommend the songs that have been listening to the largest number
of users first. This is equivalent to the first scheme.

*Trust:* Weigh each user by the number of times they have been visited. Weight
each item by the weight of the user who recommend it it. Sum the item weights
and sort them accordingly. This performs really well in practice, and what we
ended up doing.

*Relevance:* For each item visited, count the number of different items in my
listening history that lead to it. Sort according to this number. This performs
very well in practice too.


** Birdland in practice

We implemented Birdland in Go both for speed (the algorithm had to run online),
and because the backend was in Go.

*** Recommending from walks.

1. The algorithm is randomized. You have guaranteed novelty every time you
   refresh the page.
2. You can precompute many, many things when you load the data; as a result
   inference is really fast.
