blog/drafts/introducing-birdland.html


<div id="outline-container-orgd76d02b" class="outline-3">
<h3 id="orgd76d02b">Recommendations using random walks.</h3>
<div class="outline-text-3" id="text-orgd76d02b">
<p>
For those of you who are old enough to have known LastFM, you probably used the
method I did when looking for new music to listen to. What I usually did was
finding the profile of people who had roughly similar tastes and explore they
history to find new things to listened to. Sometimes work, sometimes did not.
But still, it was pretty good.
</p>

<p>
For some of you who had friends, you probably ask for recommendations to people
you know have similar tastes to you, not to the others.
</p>

<p>
Both are local explorations of a bipartite graph. This is tedious work, but
imagine if you could do that a million times faster. Wouldn't you get
interesting results? Well, let's figure it out.
</p>


<p>
If I formalize and simplify the motivating examples I get the following
procedure:
</p>

<ol class="org-ol">
<li>Pick a song \(i\) uniformly at random in my listen history;</li>
<li>Find a user \(\mu\) who has listen to this song too;</li>
<li>Pick a song \(j\) that this user has listened to uniformly at random and store
to it.</li>
</ol>

<p>
The process is overly simplified: all songs that I listen to are equal in my
eyes. Some I like more and listen to heavily, some I like less. We'll see more
about that below.
</p>

<p>
We can write the probability \(p_{ij}\) to pick the song \(j\) starting from \(i\) and
going through \(\mu\) under this procedure:
</p>

<p>
\[
p_{ij}^{\mu} = \frac{1}{N_i} \frac{1}{k_{\mu}}
\]
</p>

<p>
where \(N_i\) is the number of people who have listened to \(i\) and \(k_{\mu}\) the
number of songs the user \(\mu\) has listened to. \(p_{ij}^{\mu}\) is a transition
kernel. Indeed:
</p>

<p>
\[
\sum_{\mu, j} p_{ij}^{\mu} = \frac{1}{N_i} \sum_{\mu, j} \frac{1}{k_{\mu}} = 1
\]
</p>

<p>
The probability measure \(\pi_i = N_i / N\) defined above is invariant under this
kernel:
</p>

<p>
\[
\sum_i \frac{N_i}{N} p_{ij}^{\mu} = \frac{1}{N} \sum_{i,\mu} \frac{1}{k_{\mu}} =
\frac{N_j}{N}
\]
</p>

<p>
Indeed, for each song \(j\) the user \(\mu\) has interacted with, all the other
items are included in the dum over \(i\) so that the sum over \(i\) and \(\mu\) can be
reduced to a sum of \(j\) times 1.
</p>

<p>
Don't be thrown off by these technical details and calculations: this algorithm
is simpler and easier to interpret than the naive one above, let alone implicit
matrix factorization.
</p>
</div>
</div>

<div id="outline-container-org8b33bde" class="outline-3">
<h3 id="org8b33bde">The long tail problem</h3>
<div class="outline-text-3" id="text-org8b33bde">
<p>
[Explain the long-tail problem]
</p>

<p>
An issue that remains is that we leave the popularity distribution of songs
invariant under this transition kernel. The nice thing about this framework is
that it can be modified very easily. Let us imagine a procedure that could
diminish the "long-tail" problem:
</p>


<ol class="org-ol">
<li>Pick a song \(i\) uniformly at random from your listening history;</li>
<li>Pick a user \(\mu\) who has listened to this song uniformly at random;</li>
<li>Pick a song \(j\) this user has listened to with probability inversely
proportional to this item popularity.</li>
</ol>

<p>
The probability to walk from \(i\) to \(j\) via \(\mu\) now reads:
</p>

<p>
\[
p_{ij}^\mu = \frac{\mathcal{N}_\mu}{N_i N_j}
\]
</p>

<p>
where
</p>

<p>
\[
\mathcal{N} = \frac{1}{\sum_{n=1}^{N_\mu} 1 / N_j}
\]
</p>

<p>
We now show that the uniform probability measure is left invariant under this
kernel:
</p>

<p>
\[
\sum_i \frac{1}{N} p_{ij}^{\mu} = \frac{1}{N N_j} \sum_{\mu, j} \frac{\mathcak{N}_\mu}{N_i} = \frac{1}{N}
\]
</p>

<p>
In layman speak, this means that, following this procedure, an infinitely long
random walk would go through each song the same number of times, disrepective of
its original popularity. <b>In other words, this algorithm addresses the
long-tail problem, or at least does not make it worse.</b>
</p>

<p>
Now, whether this is a good thing is another debate.
</p>
</div>
</div>

<div id="outline-container-orgea02ca9" class="outline-3">
<h3 id="orgea02ca9">Other variants</h3>
<div class="outline-text-3" id="text-orgea02ca9">
</div>
<div id="outline-container-org50862b1" class="outline-4">
<h4 id="org50862b1">Social recommendation</h4>
<div class="outline-text-4" id="text-org50862b1">
<p>
You can customize this algorithm as you wish. In our case, the goal was to get
a recommendation algorithm that could be used for social recommendation. Easy:
</p>

<ol class="org-ol">
<li>Pick a song \(i\) uniformly at random from your listening history;</li>
<li>Pick a user \(\mu\) with a probability \(\delta\) that depends on how close
you are in the network.</li>
<li>Pick a song \(j\) this user has listened to with probability inversely
proportional to this item popularity.</li>
</ol>

<p>
In the limit \(\delta = 1/N\) we recover the previous case. In the extreme limit
\(\delta = 1/f\) where f is your number of friend, 0 otherwise we are in a
situation where you get most of your recommendations from your friends.
</p>

<p>
If you want to be fancy, you can say that you projected the multi-layer graph
user-user-song onto the user-song bipartite graph. Knowing that you can do even
fancier stuff by walking the social graph at the same time.
</p>
</div>
</div>

<div id="outline-container-orgb99e725" class="outline-4">
<h4 id="orgb99e725">Not all songs are created equal</h4>
<div class="outline-text-4" id="text-orgb99e725">
<p>
You don't listen to songs the same number of times, so it is pretty stupid to
pick songs uniformly at random in your history. Simple, just pick it at random
with a probability proportional to the number of times you have listened to this
song.
</p>
</div>
</div>
</div>

<div id="outline-container-org1192f71" class="outline-3">
<h3 id="org1192f71">Recommending items from a list of songs</h3>
<div class="outline-text-3" id="text-org1192f71">
<p>
To recommend songs to users you would perform many, many random walks starting
from that same user. Those walks will likely start from many different songs in
the listening history, and it is also likely that some songs will be traversed
by several walks. How do we combine these walks to provide recommendations.
</p>

<p>
There are several schemes you can think of:
</p>

<p>
<b>Most visited first:</b> We count the number of times each songs has been visited
and sort recommendations accordingly. This performs poorly in practice as you
end up recommending popular songs.
</p>

<p>
<b>Consensus:</b> Recommend the songs that have been listening to the largest number
of users first. This is equivalent to the first scheme.
</p>

<p>
<b>Trust:</b> Weigh each user by the number of times they have been visited. Weight
each item by the weight of the user who recommend it it. Sum the item weights
and sort them accordingly. This performs really well in practice, and what we
ended up doing.
</p>

<p>
<b>Relevance:</b> For each item visited, count the number of different items in my
listening history that lead to it. Sort according to this number. This performs
very well in practice too.
</p>
</div>
</div>


<div id="outline-container-orgcda84ac" class="outline-3">
<h3 id="orgcda84ac">Birdland in practice</h3>
<div class="outline-text-3" id="text-orgcda84ac">
<p>
We implemented Birdland in Go both for speed (the algorithm had to run online),
and because the backend was in Go.
</p>
</div>

<div id="outline-container-org1a10cba" class="outline-4">
<h4 id="org1a10cba">Recommending from walks.</h4>
<div class="outline-text-4" id="text-org1a10cba">
<ol class="org-ol">
<li>The algorithm is randomized. You have guaranteed novelty every time you
refresh the page.</li>
<li>You can precompute many, many things when you load the data; as a result
inference is really fast.</li>
</ol>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
